In [7]:
import pandas as pd
from sqlalchemy import create_engine

# Erstellen Sie eine SQLAlchemy-Verbindung
engine = create_engine('mysql+pymysql://rnv_importer:rnv_importer@localhost/rnv_big_data_mining')

In [11]:
from IPython.display import display

# Liste der Abfragen
queries = [
   "SELECT COUNT(*) 'JOURNEYS' FROM journeys",
   "SELECT COUNT(*) 'LINES' FROM `lines`",
   "SELECT COUNT(*) 'LINEGROUPS' FROM linegroups",
   "SELECT COUNT(*) 'DEAD LINES' FROM `lines` WHERE id NOT IN (SELECT DISTINCT api_line FROM journeys)",
   "SELECT COUNT(*) 'STATIONS' FROM stations",
   "SELECT COUNT(*) 'DEAD STATIONS' FROM `stations` WHERE stations.api_hafasID NOT IN (SELECT DISTINCT api_station FROM stops)",
   "SELECT COUNT(*) 'STOPS' FROM stops",
   "SELECT (SUM(TIMESTAMPDIFF(SECOND , api_plannedDeparture, api_realtimeDeparture)))/60/60/24 AS 'TOTAL DELAY (DAYS)' FROM stops WHERE api_realtimeDeparture != api_plannedDeparture",
]

# Führen Sie jede Abfrage aus und speichern Sie das Ergebnis in einem DataFrame
for query in queries:
    df = pd.read_sql_query(query, engine)
    display(df)

# Schließen Sie die Verbindung
engine.dispose()

   JOURNEYS
0     73141

   LINES
0    855

   LINEGROUPS
0         179

   DEAD LINES
0         248

   STATIONS
0      1121

   DEAD STATIONS
0            165

     STOPS
0  1417454

   TOTAL DELAY (DAYS)
0          165.010255